openvino.org
#+title: Openvino v.s. NCS2
# -*- org-export-babel-evaluate: nil -*-'
#+TAGS: Intel, AI4Y
#+OPTIONS: toc:2 ^:nil num:5
#+PROPERTY: header-args :eval never-export
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../css/white.css" />

* Intel OpenVINO
** 簡介
- OpenVINO為Intel開發的Edge AI套件，具有模型優化器和推理引擎，可支援 Windows、Linux （Ubuntu、CentOS）等作業系統
- Edge AI指將人工智慧佈署在邊緣設備中，相較於 Cloud penAI，他可以提升執行效率以及避免隱私洩露的問題，因此 AIoT 也從 Cloud AI延伸到了 Edge AI[fn:1]。
** 功能
OpenVINO 提供的重要功能就是 Model Optimizer 以及 Inference Engine，執行流程如下
1) 訓練好的模型經由 Model Optimizer 生成IR文件( xml 與 bin檔案)
2) 接著由 OpenVINO 的 Inference Engine讀取 IR model 進行推論(可透過Python與C++呼叫API來進行推論)
3) 使用者就可以透過 OpenVINO Toolkit和Inference Engine API 整合至開發應用程式。
** 程式架構
OpenVINO基本架構如下:
#+begin_src python -r -n :async :results output :exports both :eval nil
from openvino.inference_engine
import IENetwork, IECore
ie = IECore()
# 這邊模型是用 human pose estimation 的 model
model_hp = "" "D:/model/Transportation/human_pose_estimation/mobilenet-v1/dldt/FP16/human-pose-estimation-0001"
network= IENetwork(model=model_hp+".xml", weights=model_hp+".bin")
executable_network= ie.load_netw2ork(network, "CPU")
infer_request= executable_network.infer(inputs={input_name_hp: inblob})
res = executable_network.requests[cur_request_id].outputs[out_blob]
#+end_src
* Installation
** 安裝Cmake
1. 檔案在NAS
2. 加入.zshrc的path，參考[[https://medium.com/ching-i/intel-openvino%E4%BB%8B%E7%B4%B9%E8%88%87%E5%AE%89%E8%A3%9D%E6%95%99%E5%AD%B8-15b07473d998][Intel OpenVINO介紹與安裝教學]]
** 安裝openvino toolkit
要裝哪一版的toolkit才能正確執行Intel教材?
*** m_openvino_toolkit_p_2022.1.0.643_offline.dmg
#+begin_src shell -r :results output :exports both
cd /opt/intel/openvino_2022.1.0.643
./setupvars.sh
pip install openvino-dev tensorflow onnx
#+end_src
*** openvino_2021
#+begin_src shell -r :results output :exports both
cd /opt/intel/openvino_2021/deployment_tools/model_optimizer/install_prerequisites
./install_prerequisites.sh
#+end_src
** Jamf remote command
以brew安裝opencv, 或以其他user安裝
#+begin_src shell -r :results output :exports both
sudo chown -R student /usr/local
sudo chown -R student /opt
#+end_src
** 安裝brew
以Remote Desktop或Jamf的管理者身份安裝, 跳過command line按Enter步驟
#+begin_src shell -r :results output :exports both
ruby -e "$(curl -fsSL https://raw.githubusercontent.com/Homebrew/install/master/install)" < /dev/null
#+end_src
** Remote Desktop以管理者身份安裝opencv, libusb
#+begin_src shell -r :results output :exports both
/usr/local/bin/brew install opencv
/usr/local/bin/brew install libusb #for NCS2 Stick
#+end_src
** Remote Desktop以student執行
*** 解說
#+begin_src shell -r -n:results output :exports both
# 升級pip conda
python -m pip install --upgrade pip
conda update -n base -c defaults conda -y
# 建立conda 環境
conda create -n openvino python=3.7 -y
# 啟用openvino
conda activate openvino

conda install openvino-ie4py -c intel -y
conda install opencv -y

pip3 install opencv-python
pip3 install openvino
pip3 install numpy
pip3 install openvino-dev
# 下載openvino notebook
cd /Users/student/Desktop
git clone https://github.com/openvinotoolkit/openvino_notebooks.git
cd ~/Desktop/openvino_notebooks
pip3 install -r requirements.txt

# 將conda環境建立為jupyter notebook kernel
conda install -c anaconda ipykernel -y
python -m ipykernel install --user --name=openvino
#+end_src
*** Remote Desktop Copy/Paste版本
#+begin_src shell -r :results output :exports both
/opt/anaconda3/bin/python -m pip install --upgrade pip
/opt/anaconda3/bin/conda update -n base -c defaults conda -y
/opt/anaconda3/bin/conda init zsh
/opt/anaconda3/bin/conda create -n openvino python=3.7 -y
conda activate openvino
/opt/anaconda3/bin/conda install openvino-ie4py -c intel -y
/opt/anaconda3/bin/conda install opencv -y
/usr/local/bin/pip3 install opencv-python
/usr/local/bin/pip3 install openvino
/usr/local/bin/pip3 install numpy
/usr/local/bin/pip3 install openvino-dev
cd /Users/student/Desktop
/usr/bin/git clone https://github.com/openvinotoolkit/openvino_notebooks.git
cd ~/Desktop/openvino_notebooks
/usr/local/bin/pip3 install -r requirements.txt
/opt/anaconda3/bin/conda install -c anaconda ipykernel -y
python -m ipykernel install --user --name=openvino
#+end_src
重做
#+begin_src shell -r :results output :exports both
jupyter kernelspec uninstall openvino -y
conda env remove -n openvino
conda create -n openvino python=3.7 -y
conda activate openvino
pip3 install numpy==1.15
pip3 uninstall mkl-service -y
pip3 install mkl-service
pip3 install  matplotlib
conda install openvino-ie4py -c intel -y
pip3 install opencv-python
pip3 install openvino-dev
conda install matplotlib -y
conda install tensorflow -y
conda install -c anaconda ipykernel -y
python -m ipykernel install --user --name=openvino

cd /opt/intel/openvino_2021/deployment_tools/model_optimizer/install_prerequisites
./install_prerequisites.sh
cd ~/Desktop/openvino_notebooks
pip install -r requirements.txt

#+end_src
* 上次的做法
1. Install cmake
1. 文字,東西在 NAS
1. Add /Applications/CMake.app/Contents/bin to path (for default install)
   edit .bashrc file,加入
#+begin_src shell -r
source/opt/anaconda3/etc/profile.d/conda.sh
# update conda
conda update -n base -c defaults conda
python -m pip install --upgrade pip
# create environment
conda create --name Intel -y
conda activate openvino_env

pip install openvino-dev
conda install Intel

# 安裝 m_openvino_toolkit_p_2022.1.0.643_offline.dmg
# 執行 bootstrapper
cd /opt/intel/openvino_2022.1.0.643
./setupvars.sh
pip install openvino-dev tensorflow onnx

# install requirement
cd /opt/intel/openvino_2021/deployment_tools/model_optimizer/install_prerequisites
./install_prerequisites.sh


# install requirement
cd ~/Desktop
git clone https://github.com/openvinotoolkit/openvino_notebooks.git
cd ~/Desktop/openvino_notebooks
pip install -r requirements.txt





conda install openvino-ie4py -c intel -y
conda install -c anaconda ipykernel -y
pip install ipykernel -y
pip install matplotlib -y
pip install opencv-python -y
cd /opt/anaconda3/lib/python3.8/site-packages
cp -r /opt/intel/openvino_2021.4.689/python/python3.8/openvino .
python -m ipykernel install --user --name openvino_env



mo
sh demo_benchmark_app.sh
sh demo_security_barrier_camera.sh
sh demo_squeezenet_download_convert_run.sh
#+end_src

#+RESULTS:

8. Install cv2
   #+begin_src shell -r :results output :exports both
pip3 install --user opencv-python
   #+end_src

9. copy openvino to site_package
   #+begin_src shell -r :results output :exports both
cd /opt/anaconda3/lib/python3.8/site-packages
cp -r /opt/intel/openvino_2021.4.689/python/python3.8/openvino .
   #+end_src

   #+RESULTS:
* Footnotes

[fn:1][[https://medium.com/ching-i/intel-openvino%E4%BB%8B%E7%B4%B9%E8%88%87%E5%AE%89%E8%A3%9D%E6%95%99%E5%AD%B8-15b07473d998][Intel OpenVINO介紹與安裝教學]]
